SmsSever/SendSmsServiceSoapBinding.sendFailed.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://127.0.0.1">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:sendFailed>
   <cp_id>0</cp_id>
   <serviceid>0</serviceid>
   <usernumber></usernumber>
   <content></content>
  </ns1:sendFailed>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
